{
  "title": "Nicholas Varabioff",
  "summary": "I'm passionate about Software Development, always looking for efficient and different solutions to daily problems. I'm looking to give my best for the company I'm working with, and grow as a person and co-worker.",
  "about1": "My name is Nicholas Varabioff. I'm from Vancouver originally, and am currently in the second year of my undergraduate degree in Systems Design Engineering at the University of Waterloo.",
  "about2": "Outside of work, I love problem solving, playing chess, listening to podcasts, playing and watching competitive sports, and listening to all varieties of music. I'm excited to pursue an opportunity in which I can apply my skills in a challenging environment.",
  "about3": "I am currently seeking internship opportunities for Summer 2019 in Software Engineering and Product Management, so feel free to reach out if you know of any suitable opportunities!",
  "projects": [
    {
      "title": "Citation Generator",
      "dates": "June 2019",
      "description": "This is an IEEE citation generator I created for school projects, as an alternative to the free online citation generators that are filled with ads. It uses React and Redux on the frontend, with a Firebase backend, including Firestore db and Firebase Auth.",
      "url": "https://citationgenerator-24e5c.web.app/"
    },
    {
      "__title": "Spring App",
      "__dates": "June 2019 - Present",
      "__description": "Anim pariatur cliche reprehenderit, enim eiusmod high life accusamus terry richardson ad squid. Nihil anim keffiyeh helvetica, craft beer labore wes anderson cred nesciunt sapiente ea proident.",
      "__url": "https://www.facebook.com/"
    },
    {
      "__title": "Chess Game",
      "__dates": "April 2019",
      "__description": "Anim pariatur cliche reprehenderit, enim eiusmod high life accusamus terry richardson ad squid. Nihil anim keffiyeh helvetica, craft beer labore wes anderson cred nesciunt sapiente ea proident.",
      "__url": "https://lichess.org"
    }
  ],
  "experiences": [
    {
      "companyName": "Marsh & McLennan Companies",
      "logo": "https://drive.google.com/uc?id=16CjMRQI-8VAg7MLX2l_CHAMVgNL9y4-E",
      "url": "https://www.mmc.com/",
      "title": "Software Developer",
      "description": "During my recent co-op term at Marsh & McLennan Companies, I worked as part of the Financial Innfrastructure Solutions (FIS) team. While here, I contributed to maintenance and development of source code written in Java using Oracle Database, I created automated testing scripts in Automation Anywhere to perform unit and regression tests on the RMB system, and created SQL scripts to generate test data, and I contributed to development of the mobile application in React Native.",
      "dates": "May - August 2019",
      "location": "Toronto, ON"
    },
    {
      "companyName": "General Motors",
      "logo": "https://drive.google.com/uc?id=1r8QIh_fs3CSi2NHBH1Zrw121d1gxY2sB",
      "url": "https://www.gm.com/",
      "title": "Embedded Controls (Diagnostic Testing)",
      "description": "While at GM, I worked as part of the Vehicle OBD team. I was in charge of and led the development of a standalone Hardware-In-Loop testing bench. Given documentation of existing benches and a low budget, I was tasked with the creation the Global B BCM IBS Bench using only hardware that was already on site. The project required creativity, detailed planning, patience, and the ability to pick up new technical skills quickly.",
      "_comment":"Nicholas is a very fast learner: He has learned many different tools required for the project in a short time with minimal training. Nicholas's persistence in working through obstacles and frustrating issues is admirable. He consistently drives for results. This allowed him to exceed expectations for level of completion of his assigned project. - Kathryn Plastino P. Eng., Engineering Group Manager, General Motors",
      "dates": "September - December 2018",
      "location": "Markham, ON"
    },
    {
      "companyName": "Uniserve Communications",
      "logo": "https://drive.google.com/uc?id=1vUPSIXqLGRpaF7RpoJpjMhLFU3J6C0Xf",
      "url": "https://www.uniserve.com/",
      "title": "Tier 1 Technical Support",
      "description": "As Tier 1 Tech support at Uniserve, I supported customers with technical issues over phone, chat, and email in a fast-paced environment. I assisted customers in troubleshooting internet, webhosting, digital phone, and email issues, developed strong problem-solving and communication skills. I learned new technical and soft skills quickly in order to maximize productivity in my role.",
      "_comment": "Nicholas far exceeded the role's expectations by being excellent in almost every category and combining those skills to provide us an excellent resource. He was extremely self-sufficient and always dependable. Nick has excellent potential. He quickly learned and mastered a difficult role while working well in a team. - Seth Immell, Customer Service Manager, Uniserve Communications",
      "dates": "January - April 2018",
      "location": "Vancouver, BC"
    }
  ],
  "education": [
    {
      "name": "University of Waterloo",
      "logo": "https://drive.google.com/uc?id=1AV6T3JMHmhVorZaRSLMOWma_x2MaW9Te",
      "url": "https://uwaterloo.ca/systems-design-engineering/",
      "title": "Bachelor of Applied Science, Systems Design Engineering",
      "duration": "September 2017 - April 2022",
      "class1_title": "SYDE 121, 223 – Data Structures and Algorithms – C++",
      "class1_description": "Focus on structured software design, efficient algorithm design, and problem solving",
      "class2_title": "SYDE 161, 162, 261 – Design, Systems, and Society",
      "class2_description": "Developed an understanding of the engineering design process"
    }
  ]
}
